In [9]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### You are given two tables:
- users
- trades

Write a query to list the top 3 cities that had the most number of completed orders

In [10]:
%%sql
SELECT * FROM trades LIMIT 10

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[(1, 101, Decimal('49.99'), 10, 'complete', datetime.datetime(2025, 8, 18, 9, 12, 39, 502923)),
 (2, 102, Decimal('75.50'), 5, 'complete', datetime.datetime(2025, 8, 19, 9, 12, 39, 502923)),
 (3, 102, Decimal('20.00'), 15, 'cancelled', datetime.datetime(2025, 8, 20, 9, 12, 39, 502923)),
 (4, 104, Decimal('100.00'), 8, 'complete', datetime.datetime(2025, 8, 21, 9, 12, 39, 502923)),
 (5, 102, Decimal('60.25'), 20, 'cancelled', datetime.datetime(2025, 8, 22, 9, 12, 39, 502923)),
 (6, 106, Decimal('33.33'), 12, 'complete', datetime.datetime(2025, 8, 23, 9, 12, 39, 502923)),
 (7, 101, Decimal('85.75'), 7, 'cancelled', datetime.datetime(2025, 8, 24, 9, 12, 39, 502923)),
 (8, 102, Decimal('42.10'), 18, 'complete', datetime.datetime(2025, 8, 25, 9, 12, 39, 502923)),
 (9, 103, Decimal('55.55'), 9, 'complete', datetime.datetime(2025, 8, 26, 9, 12, 39, 502923)),
 (10, 104, Decimal('99.99'), 11, 'cancelled', datetime.datetime(2025, 8, 27, 9, 12, 39, 502923))]

In [11]:
%%sql
SELECT u.city, COUNT(*) AS completed_orders
FROM trades t 
INNER JOIN users u -- left join also works here
ON t.user_id = u.user_id
WHERE t.status = 'complete'
GROUP BY u.city
ORDER BY completed_orders DESC
LIMIT 3;

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[('Barcelona', 8), ('Oslo', 8), ('Amsterdam', 4)]

In [12]:
%%sql
-- in this case this solution also works because cities and users are both unique 
WITH common_cities AS(
    SELECT u.user_id, u.city,  COUNT(t.order_id) as total_orders
    FROM users u
    LEFT JOIN trades t 
    ON u.user_id = t.user_id
    GROUP BY u.user_id
    ORDER BY COUNT(t.order_id) DESC
)
SELECT city, total_orders FROM common_cities LIMIT 3;

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[('Oslo', 13), ('Barcelona', 11), ('Paris', 8)]